#Вам дан словарь per_cent с распределением процентных ставок по вкладам в различных банках таким образом, что ключ — название банка, значение — процент.
#Напишите программу, в результате которой будет сформирован список deposit значений — накопленные средства за год вклада в каждом из банков.
#На вход программы с клавиатуры вводится сумма money, которую человек планирует положить под проценты.
#per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
#Добавьте в программу поиск максимального значения и его вывод на экран в формате:
#Максимальная сумма, которую вы можете заработать — deposit[i]
#Где вместо deposit[i] будет выведено максимальное значение списка.
money = int(input('Введите сумму вклада'))
per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
deposit = []
for key in per_cent:
    deposit.append(per_cent[key] * money / 100)
max_deposit = max(deposit)
print(deposit)
print ("Максимальная сумма, которую вы можете заработать — " + str(max_deposit))